#!/bin/sh
################################################################################
# Help                                                                         #
################################################################################
Help()
{
   # Display Help
   echo ""
   echo "Скрипт предназначен для автоматического импорта данных из Базы 1С."
   echo "в папке data должны быть находиться файлы xml импорта 1С"
   echo "файлы import отвечает за импорт а файл view за создание представления"
   echo
   echo "Example >sh import.sh -i yes -c 50 -f 7"
   echo "Example >sh import.sh -v yes"
   echo
   echo "Syntax: scriptTemplate [-i|-v|-c|-f|-h]"
   echo "options:"
   echo "-i yes    Запустить импорт по всей базе."
   echo "-v yes    Пересоздать представление для товаров."
   echo "-c        Передать число товаров по умолчанию не ограничено только c -i yes"
   echo "-f        Количество файлов по умолчанию не ограничено только с -i yes"
   echo ""
   echo ""
}

################################################################################
################################################################################
# Main program                                                                 #
################################################################################
################################################################################

imp=0
viw=0

while getopts :i:v:c:f:h flag
do
    case $flag in
        c) cnt=${OPTARG};;
        f) file=${OPTARG};;
        i) imp=1;;
        v) viw=1;;
        h) Help;;
        *) echo "usage: $0 [-v yes] [-i yes]" >&2
          exit 1 ;;
    esac
done

if [ "$imp" -eq 1 ];
then
 php import.php cnt="$cnt" file="$file"
fi

if [ "$viw" -eq 1 ];
then
 php view.php create=ok
fi